MikroElektronika/core_packages/PIC/XC8/def/PIC18F27J53/mcu.h
extern volatile PMDIS1bits_t PMDIS1bits __at(0xEBA);
// bitfield macros
#define _PMDIS1_TMR1MD_POSN                                 0x1
#define _PMDIS1_TMR1MD_POSITION                             0x1
#define _PMDIS1_TMR1MD_SIZE                                 0x1
#define _PMDIS1_TMR1MD_LENGTH                               0x1
#define _PMDIS1_TMR1MD_MASK                                 0x2
#define _PMDIS1_TMR2MD_POSN                                 0x2
#define _PMDIS1_TMR2MD_POSITION                             0x2
#define _PMDIS1_TMR2MD_SIZE                                 0x1
#define _PMDIS1_TMR2MD_LENGTH                               0x1
#define _PMDIS1_TMR2MD_MASK                                 0x4
#define _PMDIS1_TMR3MD_POSN                                 0x3
#define _PMDIS1_TMR3MD_POSITION                             0x3
#define _PMDIS1_TMR3MD_SIZE                                 0x1
#define _PMDIS1_TMR3MD_LENGTH                               0x1
#define _PMDIS1_TMR3MD_MASK                                 0x8
#define _PMDIS1_TMR4MD_POSN                                 0x4
#define _PMDIS1_TMR4MD_POSITION                             0x4
#define _PMDIS1_TMR4MD_SIZE                                 0x1
#define _PMDIS1_TMR4MD_LENGTH                               0x1
#define _PMDIS1_TMR4MD_MASK                                 0x10
#define _PMDIS1_RTCCMD_POSN                                 0x5
#define _PMDIS1_RTCCMD_POSITION                             0x5
#define _PMDIS1_RTCCMD_SIZE                                 0x1
#define _PMDIS1_RTCCMD_LENGTH                               0x1
#define _PMDIS1_RTCCMD_MASK                                 0x20
#define _PMDIS1_CTMUMD_POSN                                 0x6
#define _PMDIS1_CTMUMD_POSITION                             0x6
#define _PMDIS1_CTMUMD_SIZE                                 0x1
#define _PMDIS1_CTMUMD_LENGTH                               0x1
#define _PMDIS1_CTMUMD_MASK                                 0x40
#define _PMDIS1_PMDTMR1_POSN                                0x1
#define _PMDIS1_PMDTMR1_POSITION                            0x1
#define _PMDIS1_PMDTMR1_SIZE                                0x1
#define _PMDIS1_PMDTMR1_LENGTH                              0x1
#define _PMDIS1_PMDTMR1_MASK                                0x2
#define _PMDIS1_PMDTMR2_POSN                                0x2
#define _PMDIS1_PMDTMR2_POSITION                            0x2
#define _PMDIS1_PMDTMR2_SIZE                                0x1
#define _PMDIS1_PMDTMR2_LENGTH                              0x1
#define _PMDIS1_PMDTMR2_MASK                                0x4
#define _PMDIS1_PMDTMR3_POSN                                0x3
#define _PMDIS1_PMDTMR3_POSITION                            0x3
#define _PMDIS1_PMDTMR3_SIZE                                0x1
#define _PMDIS1_PMDTMR3_LENGTH                              0x1
#define _PMDIS1_PMDTMR3_MASK                                0x8
#define _PMDIS1_PMDTMR4_POSN                                0x4
#define _PMDIS1_PMDTMR4_POSITION                            0x4
#define _PMDIS1_PMDTMR4_SIZE                                0x1
#define _PMDIS1_PMDTMR4_LENGTH                              0x1
#define _PMDIS1_PMDTMR4_MASK                                0x10
#define _PMDIS1_PMDTMR_POSN                                 0x1
#define _PMDIS1_PMDTMR_POSITION                             0x1
#define _PMDIS1_PMDTMR_SIZE                                 0x4
#define _PMDIS1_PMDTMR_LENGTH                               0x4
#define _PMDIS1_PMDTMR_MASK                                 0x1E
#define _PMDIS1_PMDRTCC_POSN                                0x5
#define _PMDIS1_PMDRTCC_POSITION                            0x5
#define _PMDIS1_PMDRTCC_SIZE                                0x1
#define _PMDIS1_PMDRTCC_LENGTH                              0x1
#define _PMDIS1_PMDRTCC_MASK                                0x20
#define _PMDIS1_PMDCTMU_POSN                                0x6
#define _PMDIS1_PMDCTMU_POSITION                            0x6
#define _PMDIS1_PMDCTMU_SIZE                                0x1
#define _PMDIS1_PMDCTMU_LENGTH                              0x1
#define _PMDIS1_PMDCTMU_MASK                                0x40
#define _PMDIS1_TMRMD_POSN                                  0x1
#define _PMDIS1_TMRMD_POSITION                              0x1
#define _PMDIS1_TMRMD_SIZE                                  0x4
#define _PMDIS1_TMRMD_LENGTH                                0x4
#define _PMDIS1_TMRMD_MASK                                  0x1E
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned RTCCMD                 :1;
        unsigned CTMUMD                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned PMDTMR1                :1;
        unsigned PMDTMR2                :1;
        unsigned PMDTMR3                :1;
        unsigned PMDTMR4                :1;
    };
    struct {
        unsigned                        :1;
        unsigned PMDTMR                 :4;
        unsigned PMDRTCC                :1;
        unsigned PMDCTMU                :1;
    };
    struct {
        unsigned                        :1;
        unsigned TMRMD                  :4;
    };
} PD1bits_t;
extern volatile PD1bits_t PD1bits __at(0xEBA);
// bitfield macros
#define _PD1_TMR1MD_POSN                                    0x1
#define _PD1_TMR1MD_POSITION                                0x1
#define _PD1_TMR1MD_SIZE                                    0x1
#define _PD1_TMR1MD_LENGTH                                  0x1
#define _PD1_TMR1MD_MASK                                    0x2
#define _PD1_TMR2MD_POSN                                    0x2
#define _PD1_TMR2MD_POSITION                                0x2
#define _PD1_TMR2MD_SIZE                                    0x1
#define _PD1_TMR2MD_LENGTH                                  0x1
#define _PD1_TMR2MD_MASK                                    0x4
#define _PD1_TMR3MD_POSN                                    0x3
#define _PD1_TMR3MD_POSITION                                0x3
#define _PD1_TMR3MD_SIZE                                    0x1
#define _PD1_TMR3MD_LENGTH                                  0x1
#define _PD1_TMR3MD_MASK                                    0x8
#define _PD1_TMR4MD_POSN                                    0x4
#define _PD1_TMR4MD_POSITION                                0x4
#define _PD1_TMR4MD_SIZE                                    0x1
#define _PD1_TMR4MD_LENGTH                                  0x1
#define _PD1_TMR4MD_MASK                                    0x10
#define _PD1_RTCCMD_POSN                                    0x5
#define _PD1_RTCCMD_POSITION                                0x5
#define _PD1_RTCCMD_SIZE                                    0x1
#define _PD1_RTCCMD_LENGTH                                  0x1
#define _PD1_RTCCMD_MASK                                    0x20
#define _PD1_CTMUMD_POSN                                    0x6
#define _PD1_CTMUMD_POSITION                                0x6
#define _PD1_CTMUMD_SIZE                                    0x1
#define _PD1_CTMUMD_LENGTH                                  0x1
#define _PD1_CTMUMD_MASK                                    0x40
#define _PD1_PMDTMR1_POSN                                   0x1
#define _PD1_PMDTMR1_POSITION                               0x1
#define _PD1_PMDTMR1_SIZE                                   0x1
#define _PD1_PMDTMR1_LENGTH                                 0x1
#define _PD1_PMDTMR1_MASK                                   0x2
#define _PD1_PMDTMR2_POSN                                   0x2
#define _PD1_PMDTMR2_POSITION                               0x2
#define _PD1_PMDTMR2_SIZE                                   0x1
#define _PD1_PMDTMR2_LENGTH                                 0x1
#define _PD1_PMDTMR2_MASK                                   0x4
#define _PD1_PMDTMR3_POSN                                   0x3
#define _PD1_PMDTMR3_POSITION                               0x3
#define _PD1_PMDTMR3_SIZE                                   0x1
#define _PD1_PMDTMR3_LENGTH                                 0x1
#define _PD1_PMDTMR3_MASK                                   0x8
#define _PD1_PMDTMR4_POSN                                   0x4
#define _PD1_PMDTMR4_POSITION                               0x4
#define _PD1_PMDTMR4_SIZE                                   0x1
#define _PD1_PMDTMR4_LENGTH                                 0x1
#define _PD1_PMDTMR4_MASK                                   0x10
#define _PD1_PMDTMR_POSN                                    0x1
#define _PD1_PMDTMR_POSITION                                0x1
#define _PD1_PMDTMR_SIZE                                    0x4
#define _PD1_PMDTMR_LENGTH                                  0x4
#define _PD1_PMDTMR_MASK                                    0x1E
#define _PD1_PMDRTCC_POSN                                   0x5
#define _PD1_PMDRTCC_POSITION                               0x5
#define _PD1_PMDRTCC_SIZE                                   0x1
#define _PD1_PMDRTCC_LENGTH                                 0x1
#define _PD1_PMDRTCC_MASK                                   0x20
#define _PD1_PMDCTMU_POSN                                   0x6
#define _PD1_PMDCTMU_POSITION                               0x6
#define _PD1_PMDCTMU_SIZE                                   0x1
#define _PD1_PMDCTMU_LENGTH                                 0x1
#define _PD1_PMDCTMU_MASK                                   0x40
#define _PD1_TMRMD_POSN                                     0x1
#define _PD1_TMRMD_POSITION                                 0x1
#define _PD1_TMRMD_SIZE                                     0x4
#define _PD1_TMRMD_LENGTH                                   0x4
#define _PD1_TMRMD_MASK                                     0x1E

// Register: PMDIS2
#define PMDIS2 PMDIS2
extern volatile unsigned char           PMDIS2              __at(0xEBB);
#ifndef _LIB_BUILD
asm("PMDIS2 equ 0EBBh");
#endif
// aliases
extern volatile unsigned char           _PD2                 __at(0xEBB);  // Note: Changed by MikroE
#ifndef _LIB_BUILD
asm("_PD2 equ 0EBBh");  // Note: Changed by MikroE
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned CMP3MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
        unsigned                        :1;
        unsigned TMR8MD                 :1;
    };
    struct {
        unsigned PMDCMP1                :1;
        unsigned PMDCMP2                :1;
        unsigned PMDCMP3                :1;
    };
    struct {
        unsigned PMDCMP                 :3;
        unsigned PMDTMR5                :1;
        unsigned PMDTMR6                :1;
        unsigned                        :1;
        unsigned PMDTMR8                :1;
    };
    struct {
        unsigned CMPMD                  :3;
    };
} PMDIS2bits_t;
extern volatile PMDIS2bits_t PMDIS2bits __at(0xEBB);
// bitfield macros
#define _PMDIS2_CMP1MD_POSN                                 0x0
#define _PMDIS2_CMP1MD_POSITION                             0x0
#define _PMDIS2_CMP1MD_SIZE                                 0x1
#define _PMDIS2_CMP1MD_LENGTH                               0x1
#define _PMDIS2_CMP1MD_MASK                                 0x1
#define _PMDIS2_CMP2MD_POSN                                 0x1
#define _PMDIS2_CMP2MD_POSITION                             0x1
#define _PMDIS2_CMP2MD_SIZE                                 0x1
#define _PMDIS2_CMP2MD_LENGTH                               0x1
#define _PMDIS2_CMP2MD_MASK                                 0x2
#define _PMDIS2_CMP3MD_POSN                                 0x2
#define _PMDIS2_CMP3MD_POSITION                             0x2
#define _PMDIS2_CMP3MD_SIZE                                 0x1
#define _PMDIS2_CMP3MD_LENGTH                               0x1
#define _PMDIS2_CMP3MD_MASK                                 0x4
#define _PMDIS2_TMR5MD_POSN                                 0x3
#define _PMDIS2_TMR5MD_POSITION                             0x3
#define _PMDIS2_TMR5MD_SIZE                                 0x1
#define _PMDIS2_TMR5MD_LENGTH                               0x1
#define _PMDIS2_TMR5MD_MASK                                 0x8
#define _PMDIS2_TMR6MD_POSN                                 0x4
#define _PMDIS2_TMR6MD_POSITION                             0x4
#define _PMDIS2_TMR6MD_SIZE                                 0x1
#define _PMDIS2_TMR6MD_LENGTH                               0x1
#define _PMDIS2_TMR6MD_MASK                                 0x10
#define _PMDIS2_TMR8MD_POSN                                 0x6
#define _PMDIS2_TMR8MD_POSITION                             0x6
#define _PMDIS2_TMR8MD_SIZE                                 0x1
#define _PMDIS2_TMR8MD_LENGTH                               0x1
#define _PMDIS2_TMR8MD_MASK                                 0x40
#define _PMDIS2_PMDCMP1_POSN                                0x0
#define _PMDIS2_PMDCMP1_POSITION                            0x0
#define _PMDIS2_PMDCMP1_SIZE                                0x1
#define _PMDIS2_PMDCMP1_LENGTH                              0x1
#define _PMDIS2_PMDCMP1_MASK                                0x1
#define _PMDIS2_PMDCMP2_POSN                                0x1
#define _PMDIS2_PMDCMP2_POSITION                            0x1
#define _PMDIS2_PMDCMP2_SIZE                                0x1
#define _PMDIS2_PMDCMP2_LENGTH                              0x1
#define _PMDIS2_PMDCMP2_MASK                                0x2
#define _PMDIS2_PMDCMP3_POSN                                0x2
#define _PMDIS2_PMDCMP3_POSITION                            0x2
#define _PMDIS2_PMDCMP3_SIZE                                0x1
#define _PMDIS2_PMDCMP3_LENGTH                              0x1
#define _PMDIS2_PMDCMP3_MASK                                0x4
#define _PMDIS2_PMDCMP_POSN                                 0x0
#define _PMDIS2_PMDCMP_POSITION                             0x0
#define _PMDIS2_PMDCMP_SIZE                                 0x3
#define _PMDIS2_PMDCMP_LENGTH                               0x3
#define _PMDIS2_PMDCMP_MASK                                 0x7
#define _PMDIS2_PMDTMR5_POSN                                0x3
#define _PMDIS2_PMDTMR5_POSITION                            0x3
#define _PMDIS2_PMDTMR5_SIZE                                0x1
#define _PMDIS2_PMDTMR5_LENGTH                              0x1
#define _PMDIS2_PMDTMR5_MASK                                0x8
#define _PMDIS2_PMDTMR6_POSN                                0x4
#define _PMDIS2_PMDTMR6_POSITION                            0x4
#define _PMDIS2_PMDTMR6_SIZE                                0x1
#define _PMDIS2_PMDTMR6_LENGTH                              0x1
#define _PMDIS2_PMDTMR6_MASK                                0x10
#define _PMDIS2_PMDTMR8_POSN                                0x6
#define _PMDIS2_PMDTMR8_POSITION                            0x6
#define _PMDIS2_PMDTMR8_SIZE                                0x1
#define _PMDIS2_PMDTMR8_LENGTH                              0x1
#define _PMDIS2_PMDTMR8_MASK                                0x40
#define _PMDIS2_CMPMD_POSN                                  0x0
#define _PMDIS2_CMPMD_POSITION                              0x0
#define _PMDIS2_CMPMD_SIZE                                  0x3
#define _PMDIS2_CMPMD_LENGTH                                0x3
#define _PMDIS2_CMPMD_MASK                                  0x7
// alias bitfield definitions
typedef union {
    struct {
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned CMP3MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
        unsigned                        :1;
        unsigned TMR8MD                 :1;
    };
    struct {
        unsigned PMDCMP1                :1;
        unsigned PMDCMP2                :1;
        unsigned PMDCMP3                :1;
    };
    struct {
        unsigned PMDCMP                 :3;
        unsigned PMDTMR5                :1;
        unsigned PMDTMR6                :1;
        unsigned                        :1;
        unsigned PMDTMR8                :1;
    };
    struct {
        unsigned CMPMD                  :3;
    };
} PD2bits_t;
extern volatile PD2bits_t PD2bits __at(0xEBB);
// bitfield macros
#define _PD2_CMP1MD_POSN                                    0x0
#define _PD2_CMP1MD_POSITION                                0x0
#define _PD2_CMP1MD_SIZE                                    0x1
#define _PD2_CMP1MD_LENGTH                                  0x1
#define _PD2_CMP1MD_MASK                                    0x1
#define _PD2_CMP2MD_POSN                                    0x1
#define _PD2_CMP2MD_POSITION                                0x1
#define _PD2_CMP2MD_SIZE                                    0x1
#define _PD2_CMP2MD_LENGTH                                  0x1
#define _PD2_CMP2MD_MASK                                    0x2
#define _PD2_CMP3MD_POSN                                    0x2
#define _PD2_CMP3MD_POSITION                                0x2
#define _PD2_CMP3MD_SIZE                                    0x1
#define _PD2_CMP3MD_LENGTH                                  0x1
#define _PD2_CMP3MD_MASK                                    0x4
#define _PD2_TMR5MD_POSN                                    0x3
#define _PD2_TMR5MD_POSITION                                0x3
#define _PD2_TMR5MD_SIZE                                    0x1
#define _PD2_TMR5MD_LENGTH                                  0x1
#define _PD2_TMR5MD_MASK                                    0x8
#define _PD2_TMR6MD_POSN                                    0x4
#define _PD2_TMR6MD_POSITION                                0x4
#define _PD2_TMR6MD_SIZE                                    0x1
#define _PD2_TMR6MD_LENGTH                                  0x1
#define _PD2_TMR6MD_MASK                                    0x10
#define _PD2_TMR8MD_POSN                                    0x6
#define _PD2_TMR8MD_POSITION                                0x6
#define _PD2_TMR8MD_SIZE                                    0x1
#define _PD2_TMR8MD_LENGTH                                  0x1
#define _PD2_TMR8MD_MASK                                    0x40
#define _PD2_PMDCMP1_POSN                                   0x0
#define _PD2_PMDCMP1_POSITION                               0x0
#define _PD2_PMDCMP1_SIZE                                   0x1
#define _PD2_PMDCMP1_LENGTH                                 0x1
#define _PD2_PMDCMP1_MASK                                   0x1
#define _PD2_PMDCMP2_POSN                                   0x1
#define _PD2_PMDCMP2_POSITION                               0x1
#define _PD2_PMDCMP2_SIZE                                   0x1
#define _PD2_PMDCMP2_LENGTH                                 0x1
#define _PD2_PMDCMP2_MASK                                   0x2
#define _PD2_PMDCMP3_POSN                                   0x2
#define _PD2_PMDCMP3_POSITION                               0x2
#define _PD2_PMDCMP3_SIZE                                   0x1
#define _PD2_PMDCMP3_LENGTH                                 0x1
#define _PD2_PMDCMP3_MASK                                   0x4
#define _PD2_PMDCMP_POSN                                    0x0
#define _PD2_PMDCMP_POSITION                                0x0
#define _PD2_PMDCMP_SIZE                                    0x3
#define _PD2_PMDCMP_LENGTH                                  0x3
#define _PD2_PMDCMP_MASK                                    0x7
#define _PD2_PMDTMR5_POSN                                   0x3
#define _PD2_PMDTMR5_POSITION                               0x3
#define _PD2_PMDTMR5_SIZE                                   0x1
#define _PD2_PMDTMR5_LENGTH                                 0x1
#define _PD2_PMDTMR5_MASK                                   0x8
#define _PD2_PMDTMR6_POSN                                   0x4
#define _PD2_PMDTMR6_POSITION                               0x4
#define _PD2_PMDTMR6_SIZE                                   0x1
#define _PD2_PMDTMR6_LENGTH                                 0x1
#define _PD2_PMDTMR6_MASK                                   0x10
#define _PD2_PMDTMR8_POSN                                   0x6
#define _PD2_PMDTMR8_POSITION                               0x6
#define _PD2_PMDTMR8_SIZE                                   0x1
#define _PD2_PMDTMR8_LENGTH                                 0x1
#define _PD2_PMDTMR8_MASK                                   0x40
#define _PD2_CMPMD_POSN                                     0x0
#define _PD2_CMPMD_POSITION                                 0x0
#define _PD2_CMPMD_SIZE                                     0x3
#define _PD2_CMPMD_LENGTH                                   0x3
#define _PD2_CMPMD_MASK                                     0x7

// Register: PMDIS3
#define PMDIS3 PMDIS3
extern volatile unsigned char           PMDIS3              __at(0xEBC);
#ifndef _LIB_BUILD
asm("PMDIS3 equ 0EBCh");
#endif
// aliases
extern volatile unsigned char           _PD3                 __at(0xEBC);  // Note: Changed by MikroE
#ifndef _LIB_BUILD
asm("_PD3 equ 0EBCh");  // Note: Changed by MikroE
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CCP4MD                 :1;
        unsigned CCP5MD                 :1;
        unsigned CCP6MD                 :1;
        unsigned CCP7MD                 :1;
        unsigned CCP8MD                 :1;
        unsigned CCP9MD                 :1;
        unsigned CCP10MD                :1;
    };
    struct {
        unsigned                        :1;
        unsigned PMDCCP4                :1;
        unsigned PMDCCP5                :1;
        unsigned PMDCCP6                :1;
        unsigned PMDCCP7                :1;
        unsigned PMDCCP8                :1;
        unsigned PMDCCP9                :1;
        unsigned PMDCCP10               :1;
    };
    struct {
        unsigned                        :1;
        unsigned PMDCCP                 :7;
    };
    struct {
        unsigned                        :1;
        unsigned CCPMD                  :7;
    };
} PMDIS3bits_t;
