MikroElektronika/core_packages/PIC/XC8/def/PIC18F27J53/mcu.h
// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0xF98);
#ifndef _LIB_BUILD
asm("PIR5 equ 0F98h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIF                :1;
        unsigned TMR5GIF                :1;
        unsigned TMR5IF                 :1;
        unsigned TMR6IF                 :1;
        unsigned TMR8IF                 :1;
        unsigned CM3IF                  :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0xF98);
// bitfield macros
#define _PIR5_TMR1GIF_POSN                                  0x0
#define _PIR5_TMR1GIF_POSITION                              0x0
#define _PIR5_TMR1GIF_SIZE                                  0x1
#define _PIR5_TMR1GIF_LENGTH                                0x1
#define _PIR5_TMR1GIF_MASK                                  0x1
#define _PIR5_TMR5GIF_POSN                                  0x1
#define _PIR5_TMR5GIF_POSITION                              0x1
#define _PIR5_TMR5GIF_SIZE                                  0x1
#define _PIR5_TMR5GIF_LENGTH                                0x1
#define _PIR5_TMR5GIF_MASK                                  0x2
#define _PIR5_TMR5IF_POSN                                   0x2
#define _PIR5_TMR5IF_POSITION                               0x2
#define _PIR5_TMR5IF_SIZE                                   0x1
#define _PIR5_TMR5IF_LENGTH                                 0x1
#define _PIR5_TMR5IF_MASK                                   0x4
#define _PIR5_TMR6IF_POSN                                   0x3
#define _PIR5_TMR6IF_POSITION                               0x3
#define _PIR5_TMR6IF_SIZE                                   0x1
#define _PIR5_TMR6IF_LENGTH                                 0x1
#define _PIR5_TMR6IF_MASK                                   0x8
#define _PIR5_TMR8IF_POSN                                   0x4
#define _PIR5_TMR8IF_POSITION                               0x4
#define _PIR5_TMR8IF_SIZE                                   0x1
#define _PIR5_TMR8IF_LENGTH                                 0x1
#define _PIR5_TMR8IF_MASK                                   0x10
#define _PIR5_CM3IF_POSN                                    0x5
#define _PIR5_CM3IF_POSITION                                0x5
#define _PIR5_CM3IF_SIZE                                    0x1
#define _PIR5_CM3IF_LENGTH                                  0x1
#define _PIR5_CM3IF_MASK                                    0x20

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0xF99);
#ifndef _LIB_BUILD
asm("IPR5 equ 0F99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIP                :1;
        unsigned TMR5GIP                :1;
        unsigned TMR5IP                 :1;
        unsigned TMR6IP                 :1;
        unsigned TMR8IP                 :1;
        unsigned CM3IP                  :1;
    };
    struct {
        unsigned CCH05                  :1;
        unsigned CCH15                  :1;
        unsigned                        :1;
        unsigned EVPOL05                :1;
        unsigned EVPOL15                :1;
    };
} IPR5bits_t;
extern volatile IPR5bits_t IPR5bits __at(0xF99);
// bitfield macros
#define _IPR5_TMR1GIP_POSN                                  0x0
#define _IPR5_TMR1GIP_POSITION                              0x0
#define _IPR5_TMR1GIP_SIZE                                  0x1
#define _IPR5_TMR1GIP_LENGTH                                0x1
#define _IPR5_TMR1GIP_MASK                                  0x1
#define _IPR5_TMR5GIP_POSN                                  0x1
#define _IPR5_TMR5GIP_POSITION                              0x1
#define _IPR5_TMR5GIP_SIZE                                  0x1
#define _IPR5_TMR5GIP_LENGTH                                0x1
#define _IPR5_TMR5GIP_MASK                                  0x2
#define _IPR5_TMR5IP_POSN                                   0x2
#define _IPR5_TMR5IP_POSITION                               0x2
#define _IPR5_TMR5IP_SIZE                                   0x1
#define _IPR5_TMR5IP_LENGTH                                 0x1
#define _IPR5_TMR5IP_MASK                                   0x4
#define _IPR5_TMR6IP_POSN                                   0x3
#define _IPR5_TMR6IP_POSITION                               0x3
#define _IPR5_TMR6IP_SIZE                                   0x1
#define _IPR5_TMR6IP_LENGTH                                 0x1
#define _IPR5_TMR6IP_MASK                                   0x8
#define _IPR5_TMR8IP_POSN                                   0x4
#define _IPR5_TMR8IP_POSITION                               0x4
#define _IPR5_TMR8IP_SIZE                                   0x1
#define _IPR5_TMR8IP_LENGTH                                 0x1
#define _IPR5_TMR8IP_MASK                                   0x10
#define _IPR5_CM3IP_POSN                                    0x5
#define _IPR5_CM3IP_POSITION                                0x5
#define _IPR5_CM3IP_SIZE                                    0x1
#define _IPR5_CM3IP_LENGTH                                  0x1
#define _IPR5_CM3IP_MASK                                    0x20
#define _IPR5_CCH05_POSN                                    0x0
#define _IPR5_CCH05_POSITION                                0x0
#define _IPR5_CCH05_SIZE                                    0x1
#define _IPR5_CCH05_LENGTH                                  0x1
#define _IPR5_CCH05_MASK                                    0x1
#define _IPR5_CCH15_POSN                                    0x1
#define _IPR5_CCH15_POSITION                                0x1
#define _IPR5_CCH15_SIZE                                    0x1
#define _IPR5_CCH15_LENGTH                                  0x1
#define _IPR5_CCH15_MASK                                    0x2
#define _IPR5_EVPOL05_POSN                                  0x3
#define _IPR5_EVPOL05_POSITION                              0x3
#define _IPR5_EVPOL05_SIZE                                  0x1
#define _IPR5_EVPOL05_LENGTH                                0x1
#define _IPR5_EVPOL05_MASK                                  0x8
#define _IPR5_EVPOL15_POSN                                  0x4
#define _IPR5_EVPOL15_POSITION                              0x4
#define _IPR5_EVPOL15_SIZE                                  0x1
#define _IPR5_EVPOL15_LENGTH                                0x1
#define _IPR5_EVPOL15_MASK                                  0x10

// Register: T1GCON
#define T1GCON T1GCON
extern volatile unsigned char           T1GCON              __at(0xF9A);
#ifndef _LIB_BUILD
asm("T1GCON equ 0F9Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned T1GGO_NOT_T1DONE       :1;
    };
    struct {
        unsigned T1GSS0                 :1;
        unsigned T1GSS1                 :1;
        unsigned T1GVAL                 :1;
        unsigned T1GGO_nT1DONE          :1;
        unsigned T1GSPM                 :1;
        unsigned T1GTM                  :1;
        unsigned T1GPOL                 :1;
        unsigned TMR1GE                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned T1GGO                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_T1DONE             :1;
    };
    struct {
        unsigned                        :3;
        unsigned nT1DONE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned T1DONE                 :1;
    };
} T1GCONbits_t;
extern volatile T1GCONbits_t T1GCONbits __at(0xF9A);
// bitfield macros
#define _T1GCON_T1GGO_NOT_T1DONE_POSN                       0x3
#define _T1GCON_T1GGO_NOT_T1DONE_POSITION                   0x3
#define _T1GCON_T1GGO_NOT_T1DONE_SIZE                       0x1
#define _T1GCON_T1GGO_NOT_T1DONE_LENGTH                     0x1
#define _T1GCON_T1GGO_NOT_T1DONE_MASK                       0x8
#define _T1GCON_T1GSS0_POSN                                 0x0
#define _T1GCON_T1GSS0_POSITION                             0x0
#define _T1GCON_T1GSS0_SIZE                                 0x1
#define _T1GCON_T1GSS0_LENGTH                               0x1
#define _T1GCON_T1GSS0_MASK                                 0x1
#define _T1GCON_T1GSS1_POSN                                 0x1
#define _T1GCON_T1GSS1_POSITION                             0x1
#define _T1GCON_T1GSS1_SIZE                                 0x1
#define _T1GCON_T1GSS1_LENGTH                               0x1
#define _T1GCON_T1GSS1_MASK                                 0x2
#define _T1GCON_T1GVAL_POSN                                 0x2
#define _T1GCON_T1GVAL_POSITION                             0x2
#define _T1GCON_T1GVAL_SIZE                                 0x1
#define _T1GCON_T1GVAL_LENGTH                               0x1
#define _T1GCON_T1GVAL_MASK                                 0x4
#define _T1GCON_T1GGO_nT1DONE_POSN                          0x3
#define _T1GCON_T1GGO_nT1DONE_POSITION                      0x3
#define _T1GCON_T1GGO_nT1DONE_SIZE                          0x1
#define _T1GCON_T1GGO_nT1DONE_LENGTH                        0x1
#define _T1GCON_T1GGO_nT1DONE_MASK                          0x8
#define _T1GCON_T1GSPM_POSN                                 0x4
#define _T1GCON_T1GSPM_POSITION                             0x4
#define _T1GCON_T1GSPM_SIZE                                 0x1
#define _T1GCON_T1GSPM_LENGTH                               0x1
#define _T1GCON_T1GSPM_MASK                                 0x10
#define _T1GCON_T1GTM_POSN                                  0x5
#define _T1GCON_T1GTM_POSITION                              0x5
#define _T1GCON_T1GTM_SIZE                                  0x1
#define _T1GCON_T1GTM_LENGTH                                0x1
#define _T1GCON_T1GTM_MASK                                  0x20
#define _T1GCON_T1GPOL_POSN                                 0x6
#define _T1GCON_T1GPOL_POSITION                             0x6
#define _T1GCON_T1GPOL_SIZE                                 0x1
#define _T1GCON_T1GPOL_LENGTH                               0x1
#define _T1GCON_T1GPOL_MASK                                 0x40
#define _T1GCON_TMR1GE_POSN                                 0x7
#define _T1GCON_TMR1GE_POSITION                             0x7
#define _T1GCON_TMR1GE_SIZE                                 0x1
#define _T1GCON_TMR1GE_LENGTH                               0x1
#define _T1GCON_TMR1GE_MASK                                 0x80
#define _T1GCON_T1GGO_POSN                                  0x3
#define _T1GCON_T1GGO_POSITION                              0x3
#define _T1GCON_T1GGO_SIZE                                  0x1
#define _T1GCON_T1GGO_LENGTH                                0x1
#define _T1GCON_T1GGO_MASK                                  0x8
#define _T1GCON_NOT_T1DONE_POSN                             0x3
#define _T1GCON_NOT_T1DONE_POSITION                         0x3
#define _T1GCON_NOT_T1DONE_SIZE                             0x1
#define _T1GCON_NOT_T1DONE_LENGTH                           0x1
#define _T1GCON_NOT_T1DONE_MASK                             0x8
#define _T1GCON_nT1DONE_POSN                                0x3
#define _T1GCON_nT1DONE_POSITION                            0x3
#define _T1GCON_nT1DONE_SIZE                                0x1
#define _T1GCON_nT1DONE_LENGTH                              0x1
#define _T1GCON_nT1DONE_MASK                                0x8
#define _T1GCON_T1DONE_POSN                                 0x3
#define _T1GCON_T1DONE_POSITION                             0x3
#define _T1GCON_T1DONE_SIZE                                 0x1
#define _T1GCON_T1DONE_LENGTH                               0x1
#define _T1GCON_T1DONE_MASK                                 0x8

